# 02: Pemilihan baris (rows selection) pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)),
                  columns=cols)

df

   A  B  C  D  E
0  3  2  4  2  4
1  1  3  1  4  2
2  3  1  4  4  1
3  2  2  3  2  1
4  2  2  4  3  2
5  4  4  1  3  1
6  4  2  4  2  1
7  2  2  1  1  1
8  2  1  4  4  4
9  1  4  1  1  4

In [2]:
## sama seperti di pembelajaran Pandas 01, tetapi yang membedakannya ada di jumlah barisnya

# Selection dengan operator logika

In [4]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  2  4  2  4
1  1  3  1  4  2
2  3  1  4  4  1
9  1  4  1  1  4

In [ ]:
## menseleksi baris-baris yang nilai kolomnya bernilai 1 atau 3

# Selection dengan fungsi isin()

In [5]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  3  2  4  2  4
1  1  3  1  4  2
2  3  1  4  4  1
9  1  4  1  1  4

# Mengenal operator negasi

In [7]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  3  2  4  2  4
1  1  3  1  4  2
2  3  1  4  4  1
9  1  4  1  1  4

In [ ]:
## yang diseleksi nilai-nilai yang tidak sama dengan 1/3